import java.io.BufferedReader;
import java.io.IOException;
import java.io.InputStreamReader;

public class Main {

  private static String text = "Одного яскравого літнього дня Оля і Петя вирішили влаштувати пікнік в лісі. Оля приготувала смачний салат, а Петя відповідав за шашлики. Після веселого обіду Оля розгорнула настільний футбол, а Петя почав шукати м'яч. Але виявилося, що Петя забув взяти м'яч з собою. Оля, звісно ж, не залишалася осторонь і вирішила допомогти. Вона взяла в руки пусту бляшанку від газованої води і сказала: Не варто хвилюватися, Петя, в нашому веселому лісі може статися будь-що. Ось, ми зробимо з цієї бляшанки м'яч, і гра продовжиться! Петя спершу подивився з недовірою, але потім усміхнувся і взяв бляшанку. Вони почали грати у футбол цією річчу, і відразу ж виявили, що це найсмішніший матч їхнього життя. Під час гри м'яч випадково відскочив від дерева і влетів в кущі, і Оля та Петя почали сміятися так, що не могли зупинитися. Їхній сміх і радість заповнили ліс і здавалося, що навіть природа долучилася до їхньої гри. По закінченню дня, коли вони поверталися додому, Петя сказав: \"Той день, коли ми грали у футбол з бляшанкою як м'яч, був найсмішнішим і найвеселішим днем у моєму житті. Оля відповіла: \"Так, це був найкращий літній день. І він показав нам, що навіть найзвичайніші речі можуть приносити радість і сміх, якщо у нас є ми і гарний настрій! З цими словами вони пішли додому, тримаючись за руки, і знали, що літо принесло їм не тільки веселощі, але й незабутні спогади про цей надзвичайний день з пустою бляшанкою від газованої води як м'яч.";

  private static BufferedReader reader = new BufferedReader(new InputStreamReader(System.in));

  public static void main(String[] args) {

    System.out.println("FunInator");

    String firstA = null;
    String secondA = null;
    String object = null;

    try {

      System.out.print("Введіть першого персонажа: ");
      firstA = reader.readLine();

      System.out.print("Введіть другого персонажа: ");

      secondA = reader.readLine();

      System.out.print("Введіть предмет: ");
      object = reader.readLine();

    } catch (IOException e) {
      System.out.println("error_code_1");
    }

    text = text.replaceAll("Оля", firstA);
    text = text.replaceAll("Петя", secondA);
    text = text.replaceAll("м'яч", object);

    System.out.println(text);
  }

}